wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_gptim.c
/**
  ******************************************************************************
  * @file    fm33l0xx_gptim.c
  * @author  FM33L0 Application Team
  * @version V0.1.0
  * @date    12-Jun-2019
  * @brief   This file provides firmware functions to manage the following 
  *          functionalities of....:
  *
*/

/* Includes ------------------------------------------------------------------*/
#include "fm33l0xx_gptim.h" 
#include "fm33l0xx_rcc.h"

/** @addtogroup fm33l0_StdPeriph_Driver
  * @{
  */

/** @defgroup GPTIM 
  * @brief GPTIM driver modules
  * @{
  */ 

void GPTIMx_TimeBaseInit(GPTIM_Type* GPTIMx,TIM_TimeBaseInitTypeDef* TIM_TimeBaseInitStruct)
{
  GPTIMx_CR1_CMS_Set(GPTIMx,GPTIMx_CR1_CMS_EDGE);//边沿对齐模式
  GPTIMx_CR1_DIR_Set(GPTIMx,TIM_TimeBaseInitStruct->TIM_CounterMode);
  GPTIMx_CR1_CKD_Set(GPTIMx,TIM_TimeBaseInitStruct->TIM_ClockDivision);
  
  GPTIMx_ARR_Write(GPTIMx,TIM_TimeBaseInitStruct->TIM_Period);
  GPTIMx_PSC_Write(GPTIMx,TIM_TimeBaseInitStruct->TIM_Prescaler);
  
  GPTIMx_EGR_UG_Setable(GPTIMx,ENABLE);//产生事件更新参数
}

void GPTIMx_ClearITPendingBit(GPTIM_Type* GPTIMx,uint32_t TIM_IT)
{
  GPTIMx->ISR = TIM_IT;
}

void GPTIMx_ITConfig(GPTIM_Type* GPTIMx,uint32_t TIM_IT, FunState NewState)
{  
  if (NewState != DISABLE)
  {
    GPTIMx->DIER |= TIM_IT;
  }
  else
  {
    GPTIMx->DIER &= ~TIM_IT;
  }
}

ITStatus GPTIMx_GetITStatus(GPTIM_Type* GPTIMx,uint32_t TIM_IT)
{ 
  uint32_t itstatus = 0x0, itenable = 0x0;
   
  itstatus = GPTIMx->ISR & TIM_IT;
  
  itenable = GPTIMx->DIER & TIM_IT;
  
  if ((itstatus != RESET) && (itenable != RESET))
  {
    return  SET;
  }
  else
  {
    return  RESET;
  }
}

void GPTIMx_Cmd(GPTIM_Type* GPTIMx,FunState NewState)
{
  
  if (NewState != DISABLE)
  {
    GPTIMx->CR1 |= GPTIMx_CR1_CEN_Msk;
  }
  else
  {
    GPTIMx->CR1 &= ~GPTIMx_CR1_CEN_Msk;
  }
}

void GPTIMx_ICInit(GPTIM_Type* GPTIMx, TIM_ICInitTypeDef* TIM_ICInitStruct)
{ 
  if (TIM_ICInitStruct->TIM_Channel == TIM_Channel_1)
  {   
    GPTIMx_CCER_CC1E_Setable(GPTIMx,DISABLE);
    GPTIMx_CCMR1_CC1S_Set(GPTIMx, TIM_ICInitStruct->TIM_ICSelection);
    GPTIMx_CCMR1_IC1F_Set(GPTIMx,TIM_ICInitStruct->TIM_ICFilter); 
    GPTIMx_CCER_CC1P_Set(GPTIMx,TIM_ICInitStruct->TIM_ICPolarity);
    GPTIMx_CCMR1_IC1PSC_Set(GPTIMx,TIM_ICInitStruct->TIM_ICPrescaler);     
    GPTIMx_CCER_CC1E_Setable(GPTIMx,ENABLE);

  }
  else if (TIM_ICInitStruct->TIM_Channel == TIM_Channel_2)
  {
    GPTIMx_CCER_CC2E_Setable(GPTIMx,DISABLE);
    GPTIMx_CCMR1_CC2S_Set(GPTIMx,TIM_ICInitStruct->TIM_ICSelection);
    GPTIMx_CCMR1_IC2F_Set(GPTIMx,TIM_ICInitStruct->TIM_ICFilter); 
    GPTIMx_CCER_CC2P_Set(GPTIMx,TIM_ICInitStruct->TIM_ICPolarity);
    GPTIMx_CCMR1_IC2PSC_Set(GPTIMx, TIM_ICInitStruct->TIM_ICPrescaler);
    GPTIMx_CCER_CC2E_Setable(GPTIMx,ENABLE);   
  }
  else if (TIM_ICInitStruct->TIM_Channel == TIM_Channel_3)
  {
    GPTIMx_CCER_CC3E_Setable(GPTIMx,DISABLE);
    GPTIMx_CCMR2_CC3S_Set(GPTIMx,TIM_ICInitStruct->TIM_ICSelection);
    GPTIMx_CCMR2_IC3F_Set(GPTIMx,TIM_ICInitStruct->TIM_ICFilter); 
    GPTIMx_CCER_CC3P_Set(GPTIMx,TIM_ICInitStruct->TIM_ICPolarity);
    GPTIMx_CCMR2_IC3PSC_Set(GPTIMx, TIM_ICInitStruct->TIM_ICPrescaler); 
    GPTIMx_CCER_CC3E_Setable(GPTIMx,ENABLE);
    
  }
  else
  {
    GPTIMx_CCER_CC4E_Setable(GPTIMx,DISABLE);
    GPTIMx_CCMR2_CC4S_Set(GPTIMx,TIM_ICInitStruct->TIM_ICSelection);
    GPTIMx_CCMR2_IC4F_Set(GPTIMx,TIM_ICInitStruct->TIM_ICFilter);   
    GPTIMx_CCER_CC4P_Set(GPTIMx,TIM_ICInitStruct->TIM_ICPolarity);
    GPTIMx_CCMR2_IC4PSC_Set(GPTIMx, TIM_ICInitStruct->TIM_ICPrescaler); 
    GPTIMx_CCER_CC4E_Setable(GPTIMx,ENABLE);  
  }
}

/* Dead time和数字滤波时钟频率分频寄存器（相对CK_INT的分频比）(Counter clocK Divider) 相关函数 */
void GPTIMx_CR1_CKD_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CR1;
	tmpreg &= ~(GPTIMx_CR1_CKD_Msk);
	tmpreg |= (SetValue & GPTIMx_CR1_CKD_Msk);
	GPTIMx->CR1 = tmpreg;
}

uint32_t GPTIMx_CR1_CKD_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CR1 & GPTIMx_CR1_CKD_Msk);
}

/* Auto-reload预装载使能 (Auto-Reload Preload Enable) 相关函数 */
void GPTIMx_CR1_ARPE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CR1 |= (GPTIMx_CR1_ARPE_Msk);
	}
	else
	{
		GPTIMx->CR1 &= ~(GPTIMx_CR1_ARPE_Msk);
	}
}

FunState GPTIMx_CR1_ARPE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CR1 & (GPTIMx_CR1_ARPE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 计数器对齐模式选择 (Counter Mode Selection) 相关函数 */
void GPTIMx_CR1_CMS_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CR1;
	tmpreg &= ~(GPTIMx_CR1_CMS_Msk);
	tmpreg |= (SetValue & GPTIMx_CR1_CMS_Msk);
	GPTIMx->CR1 = tmpreg;
}

uint32_t GPTIMx_CR1_CMS_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CR1 & GPTIMx_CR1_CMS_Msk);
}

/* 计数方向寄存器 (counter Direction) 相关函数 */
void GPTIMx_CR1_DIR_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CR1;
	tmpreg &= ~(GPTIMx_CR1_DIR_Msk);
	tmpreg |= (SetValue & GPTIMx_CR1_DIR_Msk);
	GPTIMx->CR1 = tmpreg;
}

uint32_t GPTIMx_CR1_DIR_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CR1 & GPTIMx_CR1_DIR_Msk);
}

/* 单脉冲输出模式 (One Pulse Mode) 相关函数 */
void  GPTIMx_CR1_OPM_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CR1 |= (GPTIMx_CR1_OPM_Msk);
	}
	else
	{
		GPTIMx->CR1 &= ~(GPTIMx_CR1_OPM_Msk);
	}
}

FunState  GPTIMx_CR1_OPM_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CR1 & (GPTIMx_CR1_OPM_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}
/* 更新请求选择 (Update Request Selection) 相关函数 */
void  GPTIMx_CR1_URS_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CR1 |= (GPTIMx_CR1_URS_Msk);
	}
	else
	{
		GPTIMx->CR1 &= ~(GPTIMx_CR1_URS_Msk);
	}
}

FunState  GPTIMx_CR1_URS_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CR1 & (GPTIMx_CR1_URS_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}
/* 禁止update (Update Disable) 相关函数 */
void GPTIMx_CR1_UDIS_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CR1 |= (GPTIMx_CR1_UDIS_Msk);
	}
	else
	{
		GPTIMx->CR1 &= ~(GPTIMx_CR1_UDIS_Msk);
	}
}

FunState GPTIMx_CR1_UDIS_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CR1 & (GPTIMx_CR1_UDIS_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

