wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_gptim.c
/* 计数器使能 (Counter Enable) 相关函数 */
void GPTIMx_CR1_CEN_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CR1 |= (GPTIMx_CR1_CEN_Msk);
	}
	else
	{
		GPTIMx->CR1 &= ~(GPTIMx_CR1_CEN_Msk);
	}
}

FunState GPTIMx_CR1_CEN_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CR1 & (GPTIMx_CR1_CEN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 通道1输入源选择 (Timer Input 1 Selection) 相关函数 */
void GPTIMx_CR2_TI1S_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CR2;
	tmpreg &= ~(GPTIMx_CR2_TI1S_Msk);
	tmpreg |= (SetValue & GPTIMx_CR2_TI1S_Msk);
	GPTIMx->CR2 = tmpreg;
}

uint32_t GPTIMx_CR2_TI1S_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CR2 & GPTIMx_CR2_TI1S_Msk);
}

/* 主机模式选择，用于配置主机模式下向从机发送的同步触发信号（TRGO）源 (Master Mode Selection) 相关函数 */
void GPTIMx_CR2_MMS_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CR2;
	tmpreg &= ~(GPTIMx_CR2_MMS_Msk);
	tmpreg |= (SetValue & GPTIMx_CR2_MMS_Msk);
	GPTIMx->CR2 = tmpreg;
}

uint32_t GPTIMx_CR2_MMS_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CR2 & GPTIMx_CR2_MMS_Msk);
}

/* 捕捉/比较 DMA选择 (Capture/Compare DMA Selection) 相关函数 */
void GPTIMx_CR2_CCDS_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CR2;
	tmpreg &= ~(GPTIMx_CR2_CCDS_Msk);
	tmpreg |= (SetValue & GPTIMx_CR2_CCDS_Msk);
	GPTIMx->CR2 = tmpreg;
}

uint32_t GPTIMx_CR2_CCDS_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CR2 & GPTIMx_CR2_CCDS_Msk);
}

/* 外部触发信号极性配置 (External Trigger Polarity) 相关函数 */
void GPTIMx_SMCR_ETP_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->SMCR;
	tmpreg &= ~(GPTIMx_SMCR_ETP_Msk);
	tmpreg |= (SetValue & GPTIMx_SMCR_ETP_Msk);
	GPTIMx->SMCR = tmpreg;
}

uint32_t GPTIMx_SMCR_ETP_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->SMCR & GPTIMx_SMCR_ETP_Msk);
}

/* 外部时钟使能 (External Clock Enable) 相关函数 */
void GPTIMx_SMCR_ECE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->SMCR |= (GPTIMx_SMCR_ECE_Msk);
	}
	else
	{
		GPTIMx->SMCR &= ~(GPTIMx_SMCR_ECE_Msk);
	}
}

FunState GPTIMx_SMCR_ECE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->SMCR & (GPTIMx_SMCR_ECE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 外部触发信号预分频寄存器 (External Trigger Prescaler)
外部触发信号ETRP的频率最多只能是GPTIM工作时钟的1/4，当输入信号频率较高时，可以使用预分频 相关函数 */
void GPTIMx_SMCR_ETPS_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->SMCR;
	tmpreg &= ~(GPTIMx_SMCR_ETPS_Msk);
	tmpreg |= (SetValue & GPTIMx_SMCR_ETPS_Msk);
	GPTIMx->SMCR = tmpreg;
}

uint32_t GPTIMx_SMCR_ETPS_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->SMCR & GPTIMx_SMCR_ETPS_Msk);
}

/* 外部触发信号滤波时钟和长度选择 (External Trigger Filter) 相关函数 */
void GPTIMx_SMCR_ETF_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->SMCR;
	tmpreg &= ~(GPTIMx_SMCR_ETF_Msk);
	tmpreg |= (SetValue & GPTIMx_SMCR_ETF_Msk);
	GPTIMx->SMCR = tmpreg;
}

uint32_t GPTIMx_SMCR_ETF_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->SMCR & GPTIMx_SMCR_ETF_Msk);
}

/* 主/从模式 (Master Slave Mode) 相关函数 */
void GPTIMx_SMCR_MSM_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->SMCR;
	tmpreg &= ~(GPTIMx_SMCR_MSM_Msk);
	tmpreg |= (SetValue & GPTIMx_SMCR_MSM_Msk);
	GPTIMx->SMCR = tmpreg;
}

uint32_t GPTIMx_SMCR_MSM_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->SMCR & GPTIMx_SMCR_MSM_Msk);
}

/* 触发选择，用于选择同步计数器的触发源 (Trigger Source) 相关函数 */
void GPTIMx_SMCR_TS_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->SMCR;
	tmpreg &= ~(GPTIMx_SMCR_TS_Msk);
	tmpreg |= (SetValue & GPTIMx_SMCR_TS_Msk);
	GPTIMx->SMCR = tmpreg;
}

uint32_t GPTIMx_SMCR_TS_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->SMCR & GPTIMx_SMCR_TS_Msk);
}

/* 从机模式选择 (Slave Mode Selection) 相关函数 */
void GPTIMx_SMCR_SMS_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->SMCR;
	tmpreg &= ~(GPTIMx_SMCR_SMS_Msk);
	tmpreg |= (SetValue & GPTIMx_SMCR_SMS_Msk);
	GPTIMx->SMCR = tmpreg;
}

uint32_t GPTIMx_SMCR_SMS_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->SMCR & GPTIMx_SMCR_SMS_Msk);
}

/* 捕捉比较通道4的DMA模式配置 (CC4 Burst Enable) 相关函数 */
void GPTIMx_DIER_CC4BURSTEN_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->DIER;
	tmpreg &= ~(GPTIMx_DIER_CC4BURSTEN_Msk);
	tmpreg |= (SetValue & GPTIMx_DIER_CC4BURSTEN_Msk);
	GPTIMx->DIER = tmpreg;
}

uint32_t GPTIMx_DIER_CC4BURSTEN_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->DIER & GPTIMx_DIER_CC4BURSTEN_Msk);
}

/* 捕捉比较通道3的DMA模式配置 (CC3 Burst Enable) 相关函数 */
void GPTIMx_DIER_CC3BURSTEN_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->DIER;
	tmpreg &= ~(GPTIMx_DIER_CC3BURSTEN_Msk);
	tmpreg |= (SetValue & GPTIMx_DIER_CC3BURSTEN_Msk);
	GPTIMx->DIER = tmpreg;
}

uint32_t GPTIMx_DIER_CC3BURSTEN_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->DIER & GPTIMx_DIER_CC3BURSTEN_Msk);
}

/* 捕捉比较通道2的DMA模式配置 (CC2 Burst Enable) 相关函数 */
void GPTIMx_DIER_CC2BURSTEN_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->DIER;
	tmpreg &= ~(GPTIMx_DIER_CC2BURSTEN_Msk);
	tmpreg |= (SetValue & GPTIMx_DIER_CC2BURSTEN_Msk);
	GPTIMx->DIER = tmpreg;
}

uint32_t GPTIMx_DIER_CC2BURSTEN_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->DIER & GPTIMx_DIER_CC2BURSTEN_Msk);
}

/* 捕捉比较通道1的DMA模式配置 (CC1 Burst Enable) 相关函数 */
void GPTIMx_DIER_CC1BURSTEN_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->DIER;
	tmpreg &= ~(GPTIMx_DIER_CC1BURSTEN_Msk);
	tmpreg |= (SetValue & GPTIMx_DIER_CC1BURSTEN_Msk);
	GPTIMx->DIER = tmpreg;
}

uint32_t GPTIMx_DIER_CC1BURSTEN_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->DIER & GPTIMx_DIER_CC1BURSTEN_Msk);
}

/* 外部触发DMA请求使能 (Triggered DMA Enable) 相关函数 */
void GPTIMx_DIER_TDE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->DIER |= (GPTIMx_DIER_TDE_Msk);
	}
	else
	{
		GPTIMx->DIER &= ~(GPTIMx_DIER_TDE_Msk);
	}
}

