wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_gptim.c
FunState GPTIMx_DIER_TDE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->DIER & (GPTIMx_DIER_TDE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉比较通道4的DMA请求使能 (CC4 DMA Enable) 相关函数 */
void GPTIMx_DIER_CC4DE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->DIER |= (GPTIMx_DIER_CC4DE_Msk);
	}
	else
	{
		GPTIMx->DIER &= ~(GPTIMx_DIER_CC4DE_Msk);
	}
}

FunState GPTIMx_DIER_CC4DE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->DIER & (GPTIMx_DIER_CC4DE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉比较通道3的DMA请求使能 (CC3 DMA Enable) 相关函数 */
void GPTIMx_DIER_CC3DE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->DIER |= (GPTIMx_DIER_CC3DE_Msk);
	}
	else
	{
		GPTIMx->DIER &= ~(GPTIMx_DIER_CC3DE_Msk);
	}
}

FunState GPTIMx_DIER_CC3DE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->DIER & (GPTIMx_DIER_CC3DE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉比较通道2的DMA请求使能 (CC2 DMA Enable) 相关函数 */
void GPTIMx_DIER_CC2DE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->DIER |= (GPTIMx_DIER_CC2DE_Msk);
	}
	else
	{
		GPTIMx->DIER &= ~(GPTIMx_DIER_CC2DE_Msk);
	}
}

FunState GPTIMx_DIER_CC2DE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->DIER & (GPTIMx_DIER_CC2DE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉比较通道1的DMA请求使能 (CC1 DMA Enable) 相关函数 */
void GPTIMx_DIER_CC1DE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->DIER |= (GPTIMx_DIER_CC1DE_Msk);
	}
	else
	{
		GPTIMx->DIER &= ~(GPTIMx_DIER_CC1DE_Msk);
	}
}

FunState GPTIMx_DIER_CC1DE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->DIER & (GPTIMx_DIER_CC1DE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* Update Event DMA请求使能 (Update event DMA Enable) 相关函数 */
void GPTIMx_DIER_UDE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->DIER |= (GPTIMx_DIER_UDE_Msk);
	}
	else
	{
		GPTIMx->DIER &= ~(GPTIMx_DIER_UDE_Msk);
	}
}

FunState GPTIMx_DIER_UDE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->DIER & (GPTIMx_DIER_UDE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 触发事件中断使能 (Trigger event Interrupt Enable) 相关函数 */
void GPTIMx_DIER_TIE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->DIER |= (GPTIMx_DIER_TIE_Msk);
	}
	else
	{
		GPTIMx->DIER &= ~(GPTIMx_DIER_TIE_Msk);
	}
}

FunState GPTIMx_DIER_TIE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->DIER & (GPTIMx_DIER_TIE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较通道4中断使能 (CC4 Interrupt Enable) 相关函数 */
void GPTIMx_DIER_CC4IE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->DIER |= (GPTIMx_DIER_CC4IE_Msk);
	}
	else
	{
		GPTIMx->DIER &= ~(GPTIMx_DIER_CC4IE_Msk);
	}
}

FunState GPTIMx_DIER_CC4IE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->DIER & (GPTIMx_DIER_CC4IE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较通道3中断使能 (CC3 Interrupt Enable) 相关函数 */
void GPTIMx_DIER_CC3IE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->DIER |= (GPTIMx_DIER_CC3IE_Msk);
	}
	else
	{
		GPTIMx->DIER &= ~(GPTIMx_DIER_CC3IE_Msk);
	}
}

FunState GPTIMx_DIER_CC3IE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->DIER & (GPTIMx_DIER_CC3IE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较通道2中断使能 (CC2 Interrupt Enable) 相关函数 */
void GPTIMx_DIER_CC2IE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->DIER |= (GPTIMx_DIER_CC2IE_Msk);
	}
	else
	{
		GPTIMx->DIER &= ~(GPTIMx_DIER_CC2IE_Msk);
	}
}

FunState GPTIMx_DIER_CC2IE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->DIER & (GPTIMx_DIER_CC2IE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较通道1中断使能 (CC1 Interrupt Enable) 相关函数 */
void GPTIMx_DIER_CC1IE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->DIER |= (GPTIMx_DIER_CC1IE_Msk);
	}
	else
	{
		GPTIMx->DIER &= ~(GPTIMx_DIER_CC1IE_Msk);
	}
}

FunState GPTIMx_DIER_CC1IE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->DIER & (GPTIMx_DIER_CC1IE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* Update事件中断使能 (Update event Interrupt Enable) 相关函数 */
void GPTIMx_DIER_UIE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->DIER |= (GPTIMx_DIER_UIE_Msk);
	}
	else
	{
		GPTIMx->DIER &= ~(GPTIMx_DIER_UIE_Msk);
	}
}

FunState GPTIMx_DIER_UIE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->DIER & (GPTIMx_DIER_UIE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较通道4的Overcapture中断 (Over-Capture Interrupt Flag for CC4) 相关函数 */
void GPTIMx_ISR_CC4OF_Clr(GPTIM_Type* GPTIMx)
{
	GPTIMx->ISR = GPTIMx_ISR_CC4OF_Msk;
}

FlagStatus GPTIMx_ISR_CC4OF_Chk(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->ISR & GPTIMx_ISR_CC4OF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 捕捉/比较通道3的Overcapture中断 (Over-Capture Interrupt Flag for CC3) 相关函数 */
void GPTIMx_ISR_CC3OF_Clr(GPTIM_Type* GPTIMx)
{
	GPTIMx->ISR = GPTIMx_ISR_CC3OF_Msk;
}

FlagStatus GPTIMx_ISR_CC3OF_Chk(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->ISR & GPTIMx_ISR_CC3OF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 捕捉/比较通道2的Overcapture中断 (Over-Capture Interrupt Flag for CC2) 相关函数 */
void GPTIMx_ISR_CC2OF_Clr(GPTIM_Type* GPTIMx)
{
	GPTIMx->ISR = GPTIMx_ISR_CC2OF_Msk;
}

FlagStatus GPTIMx_ISR_CC2OF_Chk(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->ISR & GPTIMx_ISR_CC2OF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 捕捉/比较通道1的Overcapture中断 (Over-Capture Interrupt Flag for CC1) 相关函数 */
void GPTIMx_ISR_CC1OF_Clr(GPTIM_Type* GPTIMx)
{
	GPTIMx->ISR = GPTIMx_ISR_CC1OF_Msk;
}

FlagStatus GPTIMx_ISR_CC1OF_Chk(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->ISR & GPTIMx_ISR_CC1OF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

