wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_gptim.c
/* 触发事件中断标志 相关函数 */
void GPTIMx_ISR_TIF_Clr(GPTIM_Type* GPTIMx)
{
	GPTIMx->ISR = GPTIMx_ISR_TIF_Msk;
}

FlagStatus GPTIMx_ISR_TIF_Chk(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->ISR & GPTIMx_ISR_TIF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 捕捉/比较通道4中断标志 (CC4 Interrupt Flag) 相关函数 */
void GPTIMx_ISR_CC4IF_Clr(GPTIM_Type* GPTIMx)
{
	GPTIMx->ISR = GPTIMx_ISR_CC4IF_Msk;
}

FlagStatus GPTIMx_ISR_CC4IF_Chk(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->ISR & GPTIMx_ISR_CC4IF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 捕捉/比较通道3中断标志 (CC3 Interrupt Flag) 相关函数 */
void GPTIMx_ISR_CC3IF_Clr(GPTIM_Type* GPTIMx)
{
	GPTIMx->ISR = GPTIMx_ISR_CC3IF_Msk;
}

FlagStatus GPTIMx_ISR_CC3IF_Chk(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->ISR & GPTIMx_ISR_CC3IF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 捕捉/比较通道2中断标志 (CC2 Interrupt Flag) 相关函数 */
void GPTIMx_ISR_CC2IF_Clr(GPTIM_Type* GPTIMx)
{
	GPTIMx->ISR = GPTIMx_ISR_CC2IF_Msk;
}

FlagStatus GPTIMx_ISR_CC2IF_Chk(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->ISR & GPTIMx_ISR_CC2IF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 捕捉/比较通道1中断标志 (CC1 Interrupt Flag) 相关函数 */
void GPTIMx_ISR_CC1IF_Clr(GPTIM_Type* GPTIMx)
{
	GPTIMx->ISR = GPTIMx_ISR_CC1IF_Msk;
}

FlagStatus GPTIMx_ISR_CC1IF_Chk(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->ISR & GPTIMx_ISR_CC1IF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* Update事件中断标志，硬件置位，软件写1清零。(Update event Interrupt Flag) 相关函数 */
void GPTIMx_ISR_UIF_Clr(GPTIM_Type* GPTIMx)
{
	GPTIMx->ISR = GPTIMx_ISR_UIF_Msk;
}

FlagStatus GPTIMx_ISR_UIF_Chk(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->ISR & GPTIMx_ISR_UIF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 软件触发，软件置位此寄存器产生触发事件，硬件自动清零 (Trigger Generate) 相关函数 */
void GPTIMx_EGR_TG_Setable(GPTIM_Type* GPTIMx,FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->EGR |= (GPTIMx_EGR_TG_Msk);
	}
	else
	{
		GPTIMx->EGR &= ~(GPTIMx_EGR_TG_Msk);
	}
}

/* 捕捉/比较通道4软件触发 (CC4 Generate) 相关函数 */
void GPTIMx_EGR_CC4G_Setable(GPTIM_Type* GPTIMx,FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->EGR |= (GPTIMx_EGR_CC4G_Msk);
	}
	else
	{
		GPTIMx->EGR &= ~(GPTIMx_EGR_CC4G_Msk);
	}
}
/* 捕捉/比较通道3软件触发 (CC3 Generate) 相关函数 */
void GPTIMx_EGR_CC3G_Setable(GPTIM_Type* GPTIMx,FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->EGR |= (GPTIMx_EGR_CC3G_Msk);
	}
	else
	{
		GPTIMx->EGR &= ~(GPTIMx_EGR_CC3G_Msk);
	}
}
/* 捕捉/比较通道2软件触发 (CC2 Generate) 相关函数 */
void GPTIMx_EGR_CC2G_Setable(GPTIM_Type* GPTIMx,FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->EGR |= (GPTIMx_EGR_CC2G_Msk);
	}
	else
	{
		GPTIMx->EGR &= ~(GPTIMx_EGR_CC2G_Msk);
	}
}
/* 捕捉/比较通道1软件触发 (CC1 Generate) 相关函数 */
void GPTIMx_EGR_CC1G_Setable(GPTIM_Type* GPTIMx,FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->EGR |= (GPTIMx_EGR_CC1G_Msk);
	}
	else
	{
		GPTIMx->EGR &= ~(GPTIMx_EGR_CC1G_Msk);
	}
}
/* 软件Update事件，软件置位此寄存器产生Update事件，硬件自动清零 (User Generate) 相关函数 */
void GPTIMx_EGR_UG_Setable(GPTIM_Type* GPTIMx,FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->EGR |= (GPTIMx_EGR_UG_Msk);
	}
	else
	{
		GPTIMx->EGR &= ~(GPTIMx_EGR_UG_Msk);
	}
}

/* 输出比较2清零使能 (OC2 Clear Enable) 相关函数 */
void GPTIMx_CCMR1_OC2CE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CCMR1 |= (GPTIMx_CCMR1_OC2CE_Msk);
	}
	else
	{
		GPTIMx->CCMR1 &= ~(GPTIMx_CCMR1_OC2CE_Msk);
	}
}

FunState GPTIMx_CCMR1_OC2CE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CCMR1 & (GPTIMx_CCMR1_OC2CE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 输出比较2模式配置，此寄存器定义OC2REF信号的行为 (OC2 Mode) 相关函数 */
void GPTIMx_CCMR1_OC2M_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CCMR1;
	tmpreg &= ~(GPTIMx_CCMR1_OC2M_Msk);
	tmpreg |= (SetValue & GPTIMx_CCMR1_OC2M_Msk);
	GPTIMx->CCMR1 = tmpreg;
}

uint32_t GPTIMx_CCMR1_OC2M_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCMR1 & GPTIMx_CCMR1_OC2M_Msk);
}

/* 输出比较2预装载使能 (OC2 Preload Enable) 相关函数 */
void GPTIMx_CCMR1_OC2PE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CCMR1 |= (GPTIMx_CCMR1_OC2PE_Msk);
	}
	else
	{
		GPTIMx->CCMR1 &= ~(GPTIMx_CCMR1_OC2PE_Msk);
	}
}

FunState GPTIMx_CCMR1_OC2PE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CCMR1 & (GPTIMx_CCMR1_OC2PE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 输出比较2快速使能 (OC2 Fast Enable) 相关函数 */
void GPTIMx_CCMR1_OC2FE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CCMR1 |= (GPTIMx_CCMR1_OC2FE_Msk);
	}
	else
	{
		GPTIMx->CCMR1 &= ~(GPTIMx_CCMR1_OC2FE_Msk);
	}
}

FunState GPTIMx_CCMR1_OC2FE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CCMR1 & (GPTIMx_CCMR1_OC2FE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较2通道选择 (CC2 channel Selection) 相关函数 */
void GPTIMx_CCMR1_CC2S_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CCMR1;
	tmpreg &= ~(GPTIMx_CCMR1_CC2S_Msk);
	tmpreg |= (SetValue & GPTIMx_CCMR1_CC2S_Msk);
	GPTIMx->CCMR1 = tmpreg;
}

uint32_t GPTIMx_CCMR1_CC2S_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCMR1 & GPTIMx_CCMR1_CC2S_Msk);
}

/* 输出比较1清零使能 (OC2 Clear Enable) 相关函数 */
void GPTIMx_CCMR1_OC1CE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CCMR1 |= (GPTIMx_CCMR1_OC1CE_Msk);
	}
	else
	{
		GPTIMx->CCMR1 &= ~(GPTIMx_CCMR1_OC1CE_Msk);
	}
}

FunState GPTIMx_CCMR1_OC1CE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CCMR1 & (GPTIMx_CCMR1_OC1CE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 输出比较1模式配置，此寄存器定义OC1REF信号的行为 (OC1 Mode) 相关函数 */
void GPTIMx_CCMR1_OC1M_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CCMR1;
	tmpreg &= ~(GPTIMx_CCMR1_OC1M_Msk);
	tmpreg |= (SetValue & GPTIMx_CCMR1_OC1M_Msk);
	GPTIMx->CCMR1 = tmpreg;
}

uint32_t GPTIMx_CCMR1_OC1M_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCMR1 & GPTIMx_CCMR1_OC1M_Msk);
}

/* 输出比较1预装载使能 (OC1 Preload Enable) 相关函数 */
void GPTIMx_CCMR1_OC1PE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CCMR1 |= (GPTIMx_CCMR1_OC1PE_Msk);
	}
	else
	{
		GPTIMx->CCMR1 &= ~(GPTIMx_CCMR1_OC1PE_Msk);
	}
}

FunState GPTIMx_CCMR1_OC1PE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CCMR1 & (GPTIMx_CCMR1_OC1PE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 输出比较1快速使能 (OC1 Fast Enable) 相关函数 */
void GPTIMx_CCMR1_OC1FE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CCMR1 |= (GPTIMx_CCMR1_OC1FE_Msk);
	}
	else
	{
		GPTIMx->CCMR1 &= ~(GPTIMx_CCMR1_OC1FE_Msk);
	}
}

FunState GPTIMx_CCMR1_OC1FE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CCMR1 & (GPTIMx_CCMR1_OC1FE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

