wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_gptim.c
/* 捕捉/比较1通道选择 (CC1 channel Selection) 相关函数 */
void GPTIMx_CCMR1_CC1S_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CCMR1;
	tmpreg &= ~(GPTIMx_CCMR1_CC1S_Msk);
	tmpreg |= (SetValue & GPTIMx_CCMR1_CC1S_Msk);
	GPTIMx->CCMR1 = tmpreg;
}

uint32_t GPTIMx_CCMR1_CC1S_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCMR1 & GPTIMx_CCMR1_CC1S_Msk);
}

/* 输入捕捉2滤波 (IC2 Filter) 相关函数 */
void GPTIMx_CCMR1_IC2F_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CCMR1;
	tmpreg &= ~(GPTIMx_CCMR1_IC2F_Msk);
	tmpreg |= (SetValue & GPTIMx_CCMR1_IC2F_Msk);
	GPTIMx->CCMR1 = tmpreg;
}

uint32_t GPTIMx_CCMR1_IC2F_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCMR1 & GPTIMx_CCMR1_IC2F_Msk);
}

/* 输入捕捉2预分频 (IC2 Prescaler) 相关函数 */
void GPTIMx_CCMR1_IC2PSC_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CCMR1;
	tmpreg &= ~(GPTIMx_CCMR1_IC2PSC_Msk);
	tmpreg |= (SetValue & GPTIMx_CCMR1_IC2PSC_Msk);
	GPTIMx->CCMR1 = tmpreg;
}

uint32_t GPTIMx_CCMR1_IC2PSC_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCMR1 & GPTIMx_CCMR1_IC2PSC_Msk);
}

/* 输入捕捉1滤波 (IC1 Filter) 相关函数 */
void GPTIMx_CCMR1_IC1F_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CCMR1;
	tmpreg &= ~(GPTIMx_CCMR1_IC1F_Msk);
	tmpreg |= (SetValue & GPTIMx_CCMR1_IC1F_Msk);
	GPTIMx->CCMR1 = tmpreg;
}

uint32_t GPTIMx_CCMR1_IC1F_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCMR1 & GPTIMx_CCMR1_IC1F_Msk);
}

/* 输入捕捉1预分频 (IC1 Prescaler) 相关函数 */
void GPTIMx_CCMR1_IC1PSC_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CCMR1;
	tmpreg &= ~(GPTIMx_CCMR1_IC1PSC_Msk);
	tmpreg |= (SetValue & GPTIMx_CCMR1_IC1PSC_Msk);
	GPTIMx->CCMR1 = tmpreg;
}

uint32_t GPTIMx_CCMR1_IC1PSC_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCMR1 & GPTIMx_CCMR1_IC1PSC_Msk);
}

/* 输出比较4清零使能 (OC4 Clear Enable) 相关函数 */
void GPTIMx_CCMR2_OC4CE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CCMR2 |= (GPTIMx_CCMR2_OC4CE_Msk);
	}
	else
	{
		GPTIMx->CCMR2 &= ~(GPTIMx_CCMR2_OC4CE_Msk);
	}
}

FunState GPTIMx_CCMR2_OC4CE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CCMR2 & (GPTIMx_CCMR2_OC4CE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 输出比较4模式配置，此寄存器定义OC4REF信号的行为 (OC4 Mode) 相关函数 */
void GPTIMx_CCMR2_OC4M_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CCMR2;
	tmpreg &= ~(GPTIMx_CCMR2_OC4M_Msk);
	tmpreg |= (SetValue & GPTIMx_CCMR2_OC4M_Msk);
	GPTIMx->CCMR2 = tmpreg;
}

uint32_t GPTIMx_CCMR2_OC4M_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCMR2 & GPTIMx_CCMR2_OC4M_Msk);
}

/* 输出比较4预装载使能 (OC4 Preload Enable) 相关函数 */
void GPTIMx_CCMR2_OC4PE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CCMR2 |= (GPTIMx_CCMR2_OC4PE_Msk);
	}
	else
	{
		GPTIMx->CCMR2 &= ~(GPTIMx_CCMR2_OC4PE_Msk);
	}
}

FunState GPTIMx_CCMR2_OC4PE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CCMR2 & (GPTIMx_CCMR2_OC4PE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 输出比较4快速使能 (OC4 Fast Enable) 相关函数 */
void GPTIMx_CCMR2_OC4FE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CCMR2 |= (GPTIMx_CCMR2_OC4FE_Msk);
	}
	else
	{
		GPTIMx->CCMR2 &= ~(GPTIMx_CCMR2_OC4FE_Msk);
	}
}

FunState GPTIMx_CCMR2_OC4FE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CCMR2 & (GPTIMx_CCMR2_OC4FE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较4通道选择 (CC4 channel Selection) 相关函数 */
void GPTIMx_CCMR2_CC4S_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CCMR2;
	tmpreg &= ~(GPTIMx_CCMR2_CC4S_Msk);
	tmpreg |= (SetValue & GPTIMx_CCMR2_CC4S_Msk);
	GPTIMx->CCMR2 = tmpreg;
}

uint32_t GPTIMx_CCMR2_CC4S_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCMR2 & GPTIMx_CCMR2_CC4S_Msk);
}

/* 输出比较3清零使能 (OC3 Clear Enable) 相关函数 */
void GPTIMx_CCMR2_OC3CE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CCMR2 |= (GPTIMx_CCMR2_OC3CE_Msk);
	}
	else
	{
		GPTIMx->CCMR2 &= ~(GPTIMx_CCMR2_OC3CE_Msk);
	}
}

FunState GPTIMx_CCMR2_OC3CE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CCMR2 & (GPTIMx_CCMR2_OC3CE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 输出比较3模式配置，此寄存器定义OC3REF信号的行为 (OC3 Mode) 相关函数 */
void GPTIMx_CCMR2_OC3M_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CCMR2;
	tmpreg &= ~(GPTIMx_CCMR2_OC3M_Msk);
	tmpreg |= (SetValue & GPTIMx_CCMR2_OC3M_Msk);
	GPTIMx->CCMR2 = tmpreg;
}

uint32_t GPTIMx_CCMR2_OC3M_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCMR2 & GPTIMx_CCMR2_OC3M_Msk);
}

/* 输出比较3预装载使能 (OC3 Preload Enable) 相关函数 */
void GPTIMx_CCMR2_OC3PE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CCMR2 |= (GPTIMx_CCMR2_OC3PE_Msk);
	}
	else
	{
		GPTIMx->CCMR2 &= ~(GPTIMx_CCMR2_OC3PE_Msk);
	}
}

FunState GPTIMx_CCMR2_OC3PE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CCMR2 & (GPTIMx_CCMR2_OC3PE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 输出比较3快速使能 (OC3 Fast Enable) 相关函数 */
void GPTIMx_CCMR2_OC3FE_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CCMR2 |= (GPTIMx_CCMR2_OC3FE_Msk);
	}
	else
	{
		GPTIMx->CCMR2 &= ~(GPTIMx_CCMR2_OC3FE_Msk);
	}
}

FunState GPTIMx_CCMR2_OC3FE_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CCMR2 & (GPTIMx_CCMR2_OC3FE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较3通道选择 (CC3 channel Selection) 相关函数 */
void GPTIMx_CCMR2_CC3S_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CCMR2;
	tmpreg &= ~(GPTIMx_CCMR2_CC3S_Msk);
	tmpreg |= (SetValue & GPTIMx_CCMR2_CC3S_Msk);
	GPTIMx->CCMR2 = tmpreg;
}

uint32_t GPTIMx_CCMR2_CC3S_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCMR2 & GPTIMx_CCMR2_CC3S_Msk);
}

/* 输入捕捉4滤波 (IC4 Filter) 相关函数 */
void GPTIMx_CCMR2_IC4F_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CCMR2;
	tmpreg &= ~(GPTIMx_CCMR2_IC4F_Msk);
	tmpreg |= (SetValue & GPTIMx_CCMR2_IC4F_Msk);
	GPTIMx->CCMR2 = tmpreg;
}

uint32_t GPTIMx_CCMR2_IC4F_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCMR2 & GPTIMx_CCMR2_IC4F_Msk);
}

/* 输入捕捉4预分频 (IC4 Prescaler) 相关函数 */
void GPTIMx_CCMR2_IC4PSC_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CCMR2;
	tmpreg &= ~(GPTIMx_CCMR2_IC4PSC_Msk);
	tmpreg |= (SetValue & GPTIMx_CCMR2_IC4PSC_Msk);
	GPTIMx->CCMR2 = tmpreg;
}

