wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_gptim.c
uint32_t GPTIMx_CCMR2_IC4PSC_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCMR2 & GPTIMx_CCMR2_IC4PSC_Msk);
}

/* 输入捕捉3滤波 (IC3 Filter) 相关函数 */
void GPTIMx_CCMR2_IC3F_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CCMR2;
	tmpreg &= ~(GPTIMx_CCMR2_IC3F_Msk);
	tmpreg |= (SetValue & GPTIMx_CCMR2_IC3F_Msk);
	GPTIMx->CCMR2 = tmpreg;
}

uint32_t GPTIMx_CCMR2_IC3F_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCMR2 & GPTIMx_CCMR2_IC3F_Msk);
}

/* 输入捕捉3预分频 (IC3 Prescaler) 相关函数 */
void GPTIMx_CCMR2_IC3PSC_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CCMR2;
	tmpreg &= ~(GPTIMx_CCMR2_IC3PSC_Msk);
	tmpreg |= (SetValue & GPTIMx_CCMR2_IC3PSC_Msk);
	GPTIMx->CCMR2 = tmpreg;
}

uint32_t GPTIMx_CCMR2_IC3PSC_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCMR2 & GPTIMx_CCMR2_IC3PSC_Msk);
}

/* 捕捉/比较4输出极性 (CC4 Polarity) 相关函数 */
void GPTIMx_CCER_CC4P_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CCER;
	tmpreg &= ~(GPTIMx_CCER_CC4P_Msk);
	tmpreg |= (SetValue & GPTIMx_CCER_CC4P_Msk);
	GPTIMx->CCER = tmpreg;
}

uint32_t GPTIMx_CCER_CC4P_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCER & GPTIMx_CCER_CC4P_Msk);
}

/* 捕捉/比较4输出使能 (CC4 output Enable) 相关函数 */
void GPTIMx_CCER_CC4E_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CCER |= (GPTIMx_CCER_CC4E_Msk);
	}
	else
	{
		GPTIMx->CCER &= ~(GPTIMx_CCER_CC4E_Msk);
	}
}

FunState GPTIMx_CCER_CC4E_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CCER & (GPTIMx_CCER_CC4E_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较3输出极性 (CC3 Polarity) 相关函数 */
void GPTIMx_CCER_CC3P_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CCER;
	tmpreg &= ~(GPTIMx_CCER_CC3P_Msk);
	tmpreg |= (SetValue & GPTIMx_CCER_CC3P_Msk);
	GPTIMx->CCER = tmpreg;
}

uint32_t GPTIMx_CCER_CC3P_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCER & GPTIMx_CCER_CC3P_Msk);
}

/* 捕捉/比较3输出使能 (CC3 output Enable) 相关函数 */
void GPTIMx_CCER_CC3E_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CCER |= (GPTIMx_CCER_CC3E_Msk);
	}
	else
	{
		GPTIMx->CCER &= ~(GPTIMx_CCER_CC3E_Msk);
	}
}

FunState GPTIMx_CCER_CC3E_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CCER & (GPTIMx_CCER_CC3E_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较2输出极性 (CC2 Polarity) 相关函数 */
void GPTIMx_CCER_CC2P_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CCER;
	tmpreg &= ~(GPTIMx_CCER_CC2P_Msk);
	tmpreg |= (SetValue & GPTIMx_CCER_CC2P_Msk);
	GPTIMx->CCER = tmpreg;
}

uint32_t GPTIMx_CCER_CC2P_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCER & GPTIMx_CCER_CC2P_Msk);
}

/* 捕捉/比较2输出使能 (CC2 output Enable) 相关函数 */
void GPTIMx_CCER_CC2E_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CCER |= (GPTIMx_CCER_CC2E_Msk);
	}
	else
	{
		GPTIMx->CCER &= ~(GPTIMx_CCER_CC2E_Msk);
	}
}

FunState GPTIMx_CCER_CC2E_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CCER & (GPTIMx_CCER_CC2E_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较1输出极性 (CC1 Polarity) 相关函数 */
void GPTIMx_CCER_CC1P_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->CCER;
	tmpreg &= ~(GPTIMx_CCER_CC1P_Msk);
	tmpreg |= (SetValue & GPTIMx_CCER_CC1P_Msk);
	GPTIMx->CCER = tmpreg;
}

uint32_t GPTIMx_CCER_CC1P_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCER & GPTIMx_CCER_CC1P_Msk);
}

/* 捕捉/比较1输出使能 (CC1 output Enable) 相关函数 */
void GPTIMx_CCER_CC1E_Setable(GPTIM_Type* GPTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPTIMx->CCER |= (GPTIMx_CCER_CC1E_Msk);
	}
	else
	{
		GPTIMx->CCER &= ~(GPTIMx_CCER_CC1E_Msk);
	}
}

FunState GPTIMx_CCER_CC1E_Getable(GPTIM_Type* GPTIMx)
{
	if (GPTIMx->CCER & (GPTIMx_CCER_CC1E_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 计数器值 (Counter) 相关函数 */
void GPTIMx_CNT_Write(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	GPTIMx->CNT = (SetValue & GPTIMx_CNT_CNT_Msk);
}

uint32_t GPTIMx_CNT_Read(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CNT & GPTIMx_CNT_CNT_Msk);
}

/* 计数器时钟（CK_CNT）预分频值 (Counter Clock Prescaler) 相关函数 */
void GPTIMx_PSC_Write(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	GPTIMx->PSC = (SetValue & GPTIMx_PSC_PSC_Msk);
}

uint32_t GPTIMx_PSC_Read(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->PSC & GPTIMx_PSC_PSC_Msk);
}

/* 计数溢出时的自动重载值 (Auto-Reload Register) 相关函数 */
void GPTIMx_ARR_Write(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	GPTIMx->ARR = (SetValue & GPTIMx_ARR_ARR_Msk);
}

uint32_t GPTIMx_ARR_Read(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->ARR & GPTIMx_ARR_ARR_Msk);
}

/* 捕捉/比较通道1寄存器 (Capture/Compare channel 1 Register) 相关函数 */
void GPTIMx_CCR1_Write(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	GPTIMx->CCR1 = (SetValue & GPTIMx_CCR1_CCR1_Msk);
}

uint32_t GPTIMx_CCR1_Read(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCR1 & GPTIMx_CCR1_CCR1_Msk);
}

/* 捕捉/比较通道2寄存器 (Capture/Compare channel 2 Register) 相关函数 */
void GPTIMx_CCR2_Write(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	GPTIMx->CCR2 = (SetValue & GPTIMx_CCR2_CCR2_Msk);
}

uint32_t GPTIMx_CCR2_Read(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCR2 & GPTIMx_CCR2_CCR2_Msk);
}

/* 捕捉/比较通道3寄存器 (Capture/Compare channel 3 Register) 相关函数 */
void GPTIMx_CCR3_Write(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	GPTIMx->CCR3 = (SetValue & GPTIMx_CCR3_CCR3_Msk);
}

uint32_t GPTIMx_CCR3_Read(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCR3 & GPTIMx_CCR3_CCR3_Msk);
}

/* 捕捉/比较通道4寄存器 (Capture/Compare channel 4 Register) 相关函数 */
void GPTIMx_CCR4_Write(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	GPTIMx->CCR4 = (SetValue & GPTIMx_CCR4_CCR4_Msk);
}

uint32_t GPTIMx_CCR4_Read(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->CCR4 & GPTIMx_CCR4_CCR4_Msk);
}

/* DMA Burst长度 (DMA Burst Length) 相关函数 */
void GPTIMx_DCR_DBL_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->DCR;
	tmpreg &= ~(GPTIMx_DCR_DBL_Msk);
	tmpreg |= (SetValue & GPTIMx_DCR_DBL_Msk);
	GPTIMx->DCR = tmpreg;
}

uint32_t GPTIMx_DCR_DBL_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->DCR & GPTIMx_DCR_DBL_Msk);
}

/* DMA基地址，定义指向寄存器的偏移地址 (DMA Burst offset Address) 相关函数 */
void GPTIMx_DCR_DBA_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->DCR;
	tmpreg &= ~(GPTIMx_DCR_DBA_Msk);
	tmpreg |= (SetValue & GPTIMx_DCR_DBA_Msk);
	GPTIMx->DCR = tmpreg;
}

