wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_gptim.c
uint32_t GPTIMx_DCR_DBA_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->DCR & GPTIMx_DCR_DBA_Msk);
}

/* DMA burst访问寄存器 (DMA Burst Access Register) 相关函数 */
void GPTIMx_DMAR_Write(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	GPTIMx->DMAR = (SetValue & GPTIMx_DMAR_DMAR_Msk);
}

uint32_t GPTIMx_DMAR_Read(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->DMAR & GPTIMx_DMAR_DMAR_Msk);
}

/* ITR输入信号选择 (Internal Trigger Source Selection) 相关函数 */
void GPTIMx_ITRSEL_ITR3SEL_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->ITRSEL;
	tmpreg &= ~(GPTIMx_ITRSEL_ITR3SEL_Msk);
	tmpreg |= (SetValue & GPTIMx_ITRSEL_ITR3SEL_Msk);
	GPTIMx->ITRSEL = tmpreg;
}

uint32_t GPTIMx_ITRSEL_ITR3SEL_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->ITRSEL & GPTIMx_ITRSEL_ITR3SEL_Msk);
}

/* ITR输入信号选择 (Internal Trigger Source Selection) 相关函数 */
void GPTIMx_ITRSEL_ITR2SEL_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->ITRSEL;
	tmpreg &= ~(GPTIMx_ITRSEL_ITR2SEL_Msk);
	tmpreg |= (SetValue & GPTIMx_ITRSEL_ITR2SEL_Msk);
	GPTIMx->ITRSEL = tmpreg;
}

uint32_t GPTIMx_ITRSEL_ITR2SEL_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->ITRSEL & GPTIMx_ITRSEL_ITR2SEL_Msk);
}

/* ITR输入信号选择 (Internal Trigger Source Selection) 相关函数 */
void GPTIMx_ITRSEL_ITR1SEL_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->ITRSEL;
	tmpreg &= ~(GPTIMx_ITRSEL_ITR1SEL_Msk);
	tmpreg |= (SetValue & GPTIMx_ITRSEL_ITR1SEL_Msk);
	GPTIMx->ITRSEL = tmpreg;
}

uint32_t GPTIMx_ITRSEL_ITR1SEL_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->ITRSEL & GPTIMx_ITRSEL_ITR1SEL_Msk);
}

/* ITR输入信号选择 (Internal Trigger Source Selection) 相关函数 */
void GPTIMx_ITRSEL_ITR0SEL_Set(GPTIM_Type* GPTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPTIMx->ITRSEL;
	tmpreg &= ~(GPTIMx_ITRSEL_ITR0SEL_Msk);
	tmpreg |= (SetValue & GPTIMx_ITRSEL_ITR0SEL_Msk);
	GPTIMx->ITRSEL = tmpreg;
}

uint32_t GPTIMx_ITRSEL_ITR0SEL_Get(GPTIM_Type* GPTIMx)
{
	return (GPTIMx->ITRSEL & GPTIMx_ITRSEL_ITR0SEL_Msk);
}


void GPTIMx_Deinit(GPTIM_Type* GPTIMx)
{
	if(GPTIMx==GPTIM0)
  {
    RCC_PRST_EN_Write(RSTKEY0);
    RCC_APBRST_CR1_GT0RST_Setable(ENABLE);  
    RCC_APBRST_CR1_GT0RST_Setable(DISABLE);
    RCC_PRST_EN_Write(RSTKEY1);
  }
  if(GPTIMx==GPTIM1)
  {
    RCC_PRST_EN_Write(RSTKEY0);
    RCC_APBRST_CR1_GT1RST_Setable(ENABLE);  
    RCC_APBRST_CR1_GT1RST_Setable(DISABLE);
    RCC_PRST_EN_Write(RSTKEY1);
  }
  
}  
/******END OF FILE****/
